CSI API ETABS v1
cDesignStrip.GetGUID Method
 Retrieves the GUID of an existing strip
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGUID(
	string Name,
	ref string GUID
)
Function GetGUID (
	Name As String,
	ByRef GUID As String
) As Integer
Dim instance As cDesignStrip
Dim Name As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetGUID(Name, GUID)
int GetGUID(
	String^ Name,
	String^% GUID
)
abstract GetGUID :
        Name : string *
        GUID : string byref -> int
Parameters
Name
Type: System.String
 The name of the strip
GUID
Type: System.String
 The GUID of the strip
Return Value
Type: Int32
 Returns zero if the function executes correctly, otherwise it returns a nonzero value.
See Also
Reference
cDesignStrip Interface
ETABSv1 Namespace